In [4]:
!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\heman\anaconda3\lib\site-packages (0.5.0)
Requirement already satisfied: ipython-genutils in c:\users\heman\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\heman\anaconda3\lib\site-packages (from ipython-sql) (0.4.4)
Requirement already satisfied: sqlalchemy>=2.0 in c:\users\heman\anaconda3\lib\site-packages (from ipython-sql) (2.0.18)
Requirement already satisfied: prettytable in c:\users\heman\anaconda3\lib\site-packages (from ipython-sql) (3.8.0)
Requirement already satisfied: ipython in c:\users\heman\anaconda3\lib\site-packages (from ipython-sql) (8.10.0)
Requirement already satisfied: six in c:\users\heman\anaconda3\lib\site-packages (from ipython-sql) (1.16.0)
Requirement already satisfied: typing-extensions>=4.2.0 in c:\users\heman\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (4.4.0)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\heman\anaconda3\lib\site-packages (from sqlalchemy>=2.0->ipython-sql) (2.0.1)
Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.30 in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (3.0.36)
Requirement already satisfied: pickleshare in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.7.5)
Requirement already satisfied: decorator in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.1.1)
Requirement already satisfied: jedi>=0.16 in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.18.1)
Requirement already satisfied: traitlets>=5 in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (5.7.1)
Requirement already satisfied: stack-data in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: colorama in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.4.6)
Requirement already satisfied: pygments>=2.4.0 in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (2.11.2)
Requirement already satisfied: matplotlib-inline in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.1.6)
Requirement already satisfied: backcall in c:\users\heman\anaconda3\lib\site-packages (from ipython->ipython-sql) (0.2.0)
Requirement already satisfied: wcwidth in c:\users\heman\anaconda3\lib\site-packages (from prettytable->ipython-sql) (0.2.5)
Requirement already satisfied: parso<0.9.0,>=0.8.0 in c:\users\heman\anaconda3\lib\site-packages (from jedi>=0.16->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: executing in c:\users\heman\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.8.3)
Requirement already satisfied: asttokens in c:\users\heman\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (2.0.5)
Requirement already satisfied: pure-eval in c:\users\heman\anaconda3\lib\site-packages (from stack-data->ipython->ipython-sql) (0.2.2)

In [5]:
%load_ext sql

In [6]:
%sql sqlite://

In [12]:
%%sql
CREATE TABLE employees (
    empno INT PRIMARY KEY,
    ename VARCHAR(10),
    job VARCHAR(9),
    email VARCHAR(50),
    mgr INT NULL,
    hiredate DATETIME,
    sal NUMERIC(7,2),
    comm NUMERIC(7,2) NULL,
    dept INT
)

 * sqlite://
Done.

[]

In [13]:
%%sql
INSERT INTO Employees VALUES
  (7369, 'SMITH', 'CLERK','smith@gmail.com', 7902, '17-DEC-1980', 800, NULL, 20);
INSERT INTO Employees VALUES
  (7499, 'ALLEN', 'SALESMAN','allen@gmail.com', 7698, '20-FEB-1981', 1600, 300, 30);
INSERT INTO Employees VALUES
  (7521, 'WARD', 'SALESMAN','ward@gmail.com', 7698, '22-FEB-1981', 1250, 500, 30);
INSERT INTO Employees VALUES
  (7566, 'JONES', 'MANAGER','jones@gmail.com', 7839, '2-APR-1981', 2975, NULL, 20);
INSERT INTO Employees VALUES
  (7654, 'MARTIN', 'SALESMAN','martin@gmail.com', 7698, '28-SEP-1981', 1250, 1400, 30);

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [32]:
%%sql
select * from Employees

 * sqlite://
Done.

[(7369, 'SMITH', 'CLERK', 'smith@gmail.com', 7902, '17-DEC-1980', 800, None, 20),
 (7499, 'ALLEN', 'SALESMAN', 'allen@gmail.com', 7698, '20-FEB-1981', 1600, 300, 30),
 (7521, 'WARD', 'SALESMAN', 'ward@gmail.com', 7698, '22-FEB-1981', 1250, 500, 30),
 (7566, 'JONES', 'MANAGER', 'jones@gmail.com', 7839, '2-APR-1981', 2975, None, 20),
 (7654, 'MARTIN', 'SALESMAN', 'martin@gmail.com', 7698, '28-SEP-1981', 1250, 1400, 30)]

In [33]:
%%sql
select ename, email from employees;

 * sqlite://
Done.

[('SMITH', 'smith@gmail.com'),
 ('ALLEN', 'allen@gmail.com'),
 ('WARD', 'ward@gmail.com'),
 ('JONES', 'jones@gmail.com'),
 ('MARTIN', 'martin@gmail.com')]

In [17]:
%%sql
CREATE TABLE CUSTOMERS(
    ID   INT              NOT NULL,
    NAME VARCHAR (20)     NOT NULL,
    AGE  INT              NOT NULL,
    CITY  CHAR (25) ,
    SALARY   DECIMAL (18, 2), 
    PHONE VARCHAR (20)
);

 * sqlite://
Done.

[]

In [18]:
%%sql
INSERT INTO CUSTOMERS (ID,NAME,AGE,CITY,SALARY,PHONE)
VALUES (1, 'john', 32, 'New York', 2000.00, '+1-813-908-1223');

INSERT INTO CUSTOMERS (ID,NAME,AGE,CITY,SALARY,PHONE)
VALUES (2, 'Khilan', 25, 'Delhi', 1500.00, '9441150703');

INSERT INTO CUSTOMERS (ID,NAME,AGE,CITY,SALARY,PHONE)
VALUES (3, 'kaushik', 23, 'Kota', 2000.00,'9775513359');

 * sqlite://
1 rows affected.
1 rows affected.
1 rows affected.

[]

In [36]:
%%sql
select * from CUSTOMERS

 * sqlite://
Done.

[(1, 'john', 32, 'New York', 2000, '+1-813-908-1223'),
 (2, 'Khilan', 25, 'Delhi', 1500, '9441150703'),
 (3, 'kaushik', 23, 'Kota', 2000, '9775513359')]

In [27]:
%%sql
select * from CUSTOMERS where city = 'New York'

 * sqlite://
Done.

[(1, 'john', 32, 'New York', 2000, '+1-813-908-1223')]

In [8]:
%%sql
CREATE TABLE users (
  id INT PRIMARY KEY,
  username VARCHAR(50),
  email VARCHAR(100),
  RegistrationDate DATE,
  DateOfBirth DATE,
  full_name VARCHAR(100),
  address VARCHAR(200),
  phone_number VARCHAR(20)
);

 * sqlite://
Done.

[]

In [9]:
%%sql
INSERT INTO users (id, username, email, RegistrationDate, DateOfBirth, full_name, address, phone_number)
VALUES
  (1, 'johnDoe', 'johndoe@example.com', '2022-01-15', '1990-05-20', 'John Doe', '123 Main St', '555-1234'),
  (2, 'janeSmith', 'janesmith@example.com', '2022-02-20', '1988-09-10', 'Jane Smith', '456 Elm St', '555-5678'),
  (3, 'bobJohnson', 'bobjohnson@example.com', '2022-03-25', '1995-12-01', 'Bob Johnson', '789 Oak St', '555-9101');

 * sqlite://
3 rows affected.

[]

In [11]:
%%sql
SELECT * FROM Users ORDER BY DateOfBirth DESC;

 * sqlite://
Done.

[(3, 'bobJohnson', 'bobjohnson@example.com', '2022-03-25', '1995-12-01', 'Bob Johnson', '789 Oak St', '555-9101'),
 (1, 'johnDoe', 'johndoe@example.com', '2022-01-15', '1990-05-20', 'John Doe', '123 Main St', '555-1234'),
 (2, 'janeSmith', 'janesmith@example.com', '2022-02-20', '1988-09-10', 'Jane Smith', '456 Elm St', '555-5678')]

In [15]:
%%sql
select max(sal) as salary,ename, job from employees

 * sqlite://
Done.

[(2975, 'JONES', 'MANAGER')]

In [19]:
%%sql
SELECT * FROM Customers WHERE Phone LIKE '+1-___-___-____';

 * sqlite://
Done.

[(1, 'john', 32, 'New York', 2000, '+1-813-908-1223')]

In [23]:
%%sql
CREATE TABLE Orders (
  id INT PRIMARY KEY,
  customer_id INT,
  purchase_amount DECIMAL(10,2),
  order_date DATE,
  FOREIGN KEY (customer_id) REFERENCES Customers(id)
);

INSERT INTO Orders (id, customer_id, purchase_amount, order_date)
VALUES
  (1, 1, 100.00, '2022-01-15'),
  (2, 2, 150.50, '2022-02-20'),
  (3, 1, 75.25, '2022-02-25'),
  (4, 3, 200.00, '2022-03-10'),
  (5, 2, 50.75, '2022-03-15');


SELECT c.name, SUM(o.purchase_amount) AS total_purchase_amount
FROM Orders o INNER JOIN Customers c 
ON o.customer_id = c.id
GROUP BY c.name
ORDER BY total_purchase_amount DESC
LIMIT 5;

 * sqlite://
Done.
5 rows affected.
Done.

[('Khilan', 201.25), ('kaushik', 200), ('john', 175.25)]

In [24]:
%%sql
CREATE TABLE Sales (
  id INT PRIMARY KEY,
  category_name VARCHAR(100),
  sales_amount DECIMAL(10,2)
);

INSERT INTO Sales (id, category_name, sales_amount)
VALUES
  (1, 'Electronics', 1000.00),
  (2, 'Clothing', 500.50),
  (3, 'Home Appliances', 750.25),
  (4, 'Books', 300.00),
  (5, 'Sports Equipment', 400.75);

SELECT
    category_name,
    SUM(sales_amount) AS total_sales_amount,
    (SUM(sales_amount) / (SELECT SUM(sales_amount) FROM Sales)) * 100 AS sales_percentage
FROM
    Sales
GROUP BY
    category_name;

 * sqlite://
Done.
5 rows affected.
Done.

[('Books', 300, 10.16432322547857),
 ('Clothing', 500.5, 16.957479247840084),
 ('Electronics', 1000, 33.8810774182619),
 ('Home Appliances', 750.25, 25.419278333050993),
 ('Sports Equipment', 400.75, 13.577841775368457)]

In [26]:
%%sql

CREATE TABLE Customers1 (
  id INT PRIMARY KEY,
  name VARCHAR(100),
  email VARCHAR(100),
  phone VARCHAR(20),
  address VARCHAR(200)
);

INSERT INTO Customers1 (id, name, email, phone, address)
VALUES
  (1, 'John Doe', 'johndoe@example.com', '555-1234', '123 Main St'),
  (2, 'Jane Smith', 'janesmith@example.com', '555-5678', '456 Elm St'),
  (3, 'Bob Johnson', 'bobjohnson@example.com', '555-9101', '789 Oak St');

SELECT
    c.name,
    c.email,
    SUM(o.purchase_amount) AS total_purchase_amount
FROM
    Orders o
    JOIN Customers1 c ON o.customer_id = c.id
GROUP BY
    c.name,
    c.email
HAVING
    SUM(o.purchase_amount) = (
        SELECT MAX(total_purchase)
        FROM (
            SELECT SUM(purchase_amount) AS total_purchase
            FROM Orders
            GROUP BY customer_id
        ) AS purchases
    );

 * sqlite://
Done.
3 rows affected.
Done.

[('Jane Smith', 'janesmith@example.com', 201.25)]